//
// Created by LiMi on 2026/8/26.
//

#include "../Header/_86_Continuous_Integration_in_CPP.h"

void _86_Continuous_Integration_in_CPP::main() {
    //今天我们要聊的是持续集成这个话题 也就是我们常说的CI
    // 就是在开发过程中持续整合代码的工作流程
    // 简单来说就是自动化构建和测试 来自不同平台的开发人员
    // 协同开发并持续更新代码的工作方式
    // 比如，有些开发者可能不会在所有平台上测试代码
    // 就可能导致其他开发者的项目完全无法构建
    // 或是特定平台、特定配置环境下才会暴露 毕竟他们更愿意把精力放在其他开发任务上
    // 这时候就需要借助单元测试或其他测试框架
    // 这种低效模式正是持续集成技术要解决的痛点 它能将代码验证的全流程自动化
    // 确保代码能在各平台各配置环境下成功编译 本质上我们想要实现的是代码的自动构建
    // 并自动运行程序验证能否正常启动 搭建持续集成环境。Jenkins完全免费开源
}